{"meta":{"title":"晨星科技","subtitle":"专注人工智能","description":"专注人工智能","author":"wandou","url":"http://blog.iruach.com"},"pages":[{"title":"关于","date":"2018-11-23T15:22:25.000Z","updated":"2018-11-23T07:29:52.827Z","comments":true,"path":"about/index.html","permalink":"http://blog.iruach.com/about/index.html","excerpt":"","text":"企业网站，个人博客等WordPress网站开发定制免费SS SSR 机场分享 企业VIP定制需求请加 QQ：251249234 备注需求 不备注需求不回复"},{"title":"categories","date":"2018-11-23T18:33:56.000Z","updated":"2018-11-23T10:40:29.727Z","comments":true,"path":"categories/index.html","permalink":"http://blog.iruach.com/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2018-11-26T02:33:30.759Z","updated":"2018-11-26T02:33:30.749Z","comments":true,"path":"tags/index.html","permalink":"http://blog.iruach.com/tags/index.html","excerpt":"","text":""},{"title":"内购","date":"2018-12-25T15:44:42.000Z","updated":"2018-12-25T07:44:42.803Z","comments":true,"path":"内购/index.html","permalink":"http://blog.iruach.com/内购/index.html","excerpt":"","text":""}],"posts":[{"title":"SSR免费节点2019","slug":"SSR免费节点2019","date":"2019-05-15T22:22:17.000Z","updated":"2019-05-15T14:57:19.852Z","comments":true,"path":"2019/05/16/SSR免费节点2019/","link":"","permalink":"http://blog.iruach.com/2019/05/16/SSR免费节点2019/","excerpt":"","text":"分享一些 SSR 公益节点，晚高峰时期网络会有拥挤，错开晚间时期，体验会更好。节点来之不易，请珍惜使用，如有已经不能使用的，欢迎在下方留言，我会随时更新 免费节点会有限速，地址也会定期更新，想体验高速节点，请点击下面链接注册 http://www.xiaokeli.me/register?aff=79 ssr免费节点分享推广 通过您的推广链接注册并激活，你们双方都将获得 10GB 流量奖励； 日本节点： 服务器：ssr1.xiaokeli.info远程端口：12019密码：xiaokeli.me加密方法：aes-256-cfb路由：绕过局域网及中国大陆地址 协议：origin协议参数：混淆方式：plain混淆参数：本地端口：1080 服务器：ssr2.xiaokeli.info远程端口：12019密码：xiaokeli.me加密方法：aes-256-cfb路由：绕过局域网及中国大陆地址 协议：origin协议参数：混淆方式：plain混淆参数：本地端口：1080 美国节点： 服务器：ssr3.xiaokeli.info远程端口：12019密码：xiaokeli.me加密方法：aes-256-cfb路由：绕过局域网及中国大陆地址 协议：origin协议参数：混淆方式：plain混淆参数：本地端口：1080","categories":[{"name":"科学上网","slug":"科学上网","permalink":"http://blog.iruach.com/categories/科学上网/"}],"tags":[{"name":"SSR","slug":"SSR","permalink":"http://blog.iruach.com/tags/SSR/"},{"name":"VPS","slug":"VPS","permalink":"http://blog.iruach.com/tags/VPS/"}]},{"title":"vps搭建ss教程","slug":"vps搭建ss教程","date":"2018-12-25T16:01:33.000Z","updated":"2018-12-25T08:13:05.159Z","comments":true,"path":"2018/12/26/vps搭建ss教程/","link":"","permalink":"http://blog.iruach.com/2018/12/26/vps搭建ss教程/","excerpt":"","text":"1 搬瓦工搭建ss教程2 vultr搭建ss教程3 frp内网穿透服务端，客户端（树莓派）配置","categories":[{"name":"科学上网","slug":"科学上网","permalink":"http://blog.iruach.com/categories/科学上网/"}],"tags":[{"name":"ss","slug":"ss","permalink":"http://blog.iruach.com/tags/ss/"}]},{"title":"App Store内购审核过程","slug":"内购","date":"2018-12-25T15:47:47.000Z","updated":"2018-12-25T07:57:19.573Z","comments":true,"path":"2018/12/25/内购/","link":"","permalink":"http://blog.iruach.com/2018/12/25/内购/","excerpt":"","text":"第1次提交打算上内购功能，在提交时候不小心勾选了内购的选项，还有内购的商品 被拒：Nov 28, 2018 at 11:03 PM 123456789101112131415Nov 28, 2018 at 11:03 PMFrom Apple3. Business: PreambleGuideline 3.0 - BusinessWe began the review of your app, but we are not able to continue because we need additional information about your app.Please reply to this message in Resolution Center to confirm that the price of your 6986艺点, 149.99 USD, is the intended price. If you have additional information about your app, please include it in your response as well.Once we receive your confirmation, we will continue with the review of your app.Since your App Store Connect status is Metadata Rejected, we do NOT require a new binary. To revise the metadata, visit App Store Connect to select your app and revise the desired metadata values. Once you’ve completed all changes, reply to this message in Resolution Center and we will continue the review. 我们的回复：Nov 29, 2018 at 9:41 AM 123Nov 29, 2018 at 9:41 AMFrom iart@boe.com.cn (Beijing BOE Artcloud Technology Co. Ltd)您好，我们3.0.2版本还没有加APP内购项目，我们只是在3.0.2版本修改了几个小bug，希望你们能继续审核。 第2次提交被拒：Nov 30, 2018 at 6:08 AM原因：在app有购买虚拟商品，但是没有走苹果内购1234567891011121314151617181920212223Nov 30, 2018 at 6:08 AMFrom Apple2. 1 Performance: App CompletenessGuideline 2.1 - Performance - App CompletenessThank you for resubmitting your app. We have continued the review and would like to provide our findings.We found that while you have submitted in-app purchase products for your app, the in-app purchase functionality is not present in your binary.Next StepsIf you would like to include in-app purchases in your app, you will need to upload a new binary that incorporates the in-app purchase API to enable users to make a purchase.Once you revise and resubmit your binary, you will also need to resubmit your in-app purchases for review since they are in the Developer Action Required state. For each in-app purchase product submitted, please be sure to edit the detail information or cancel the request to change the detail information for the in-app purchases using App Store Connect.Alternatively, if you do not want to include in-app purchase products in your app, it would be appropriate to remove any unused in-app purchase products from App Store Connect.ResourcesFor more information on how to implement in-app purchase in your app, please refer to the In-App Purchase Programming Guide.Learn more about offering in-app purchases in App Store Connect Help. 我们的操作：把内购商品删掉，再次提交 第3次提交被拒：Dec 2, 2018 at 8:00 AM 原因：1 在app有购买虚拟商品，但是没有走苹果内购2 强制要求用户认证 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051Dec 2, 2018 at 8:00 AMFrom Apple3. 1.1 Business: Payments - In-App Purchase5. 1.1 Legal: Privacy - Data Collection and StorageGuideline 3.1.1 - Business - Payments - In-App PurchaseWe noticed that your app or its metadata enables the purchase of content, services, or functionality in the app by means other than the in-app purchase API, which is not appropriate for the App Store.Specifically, your app enables points, or intermediate currencies, without using the in-app purchase API. Additionally, please note that the cost of the points or the intermediate currency cannot be included in the purchase price of the app.Next StepsWhile the payment system that you have included may conduct the transaction outside of the app, if the purchasable content, functionality, or services are intended to be used in the app, they must be purchased using in-app purchase, within the app - unless it is of the type referenced in guideline 3.1.3 of the App Store Review Guidelines.In-App PurchaseIt may be appropriate to revise your app to use the in-app purchase API to provide content purchasing functionality.In-app purchase provides several benefits, including:- The flexibility to support a variety of business models.- Impacting your app ranking by consolidating your sales to one app rather than distributing them across multiple apps.- An effective marketing vehicle to drive additional sales of new content.For information on in-app purchase, please refer to the following documentation:In-App Purchase for DevelopersIn-App Purchase Programming GuideFor step-by-step instructions on in-app purchase creation within App Store Connect, refer to App Store Connect Help.Guideline 5.1.1 - Legal - Privacy - Data Collection and StorageWe noticed that your app requires users to register with Chinese National ID and passport number to post “public works”, which does not comply with the App Store Review Guidelines.Apps cannot require user registration prior to allowing access to app content and features that are not associated specifically to the user.Next StepsUser registration that requires the sharing of personal information must be optional or tied to account-specific functionality.To resolve this issue, please make it clear to the user that registering will enable them to access the content from any of their iOS devices and provide them a way to register at any time, if they wish to later extend access to additional iOS devices.Please note that although guideline 3.1.2 of the App Store Review Guidelines requires an app to make subscription content available to all the iOS devices owned by a single user, it is not appropriate to force user registration to meet this requirement; such user registration must be made optional.Please see attached screenshots for details. 苹果截图： 限量收藏 支付宝支付 用户认证 我们的回复： 1 声明购买的作品是推送到硬件的，而不是在app内使用 2 发布公开作品要求用户认证是遵守国家网络安全法 并且录了个视频演示如果购买作品并推送到硬件设备 1234567891011Dec 3, 2018 at 11:02 PMFrom iart@boe.com.cn (Beijing BOE Artcloud Technology Co. Ltd)Dear APPLE team，The following are our explanations about the two problems in your email.1) 3. 1.1 Business: Payments - In-App PurchaseThe limited collection of the items on our platform is used for our hardware rather than for the APP. Users can push specified pictures to the screen of our hardwares after the purchase. We just attached a detailed video to explain it.2) 5. 1.1 Legal: Privacy - Data Collection and StorageOnly Certified Users can post ‘public works’ which can be seen and purchased by our users. According to the Chinese internet security laws, users must verify the ID before they make public opinions and public behaviors, including the ‘public works’. And if you don&apos;t want to upload your identity , you can only upload private works, which can’t be seen by others.limited_collection.mov 第4次提交被拒：Dec 5, 2018 at 7:33 AM原因：购买的商品和服务是在app内使用的，但是没有走苹果内购 12345678910Guideline 3.1.1 - Business - Payments - In-App PurchaseWe noticed that your app or its metadata enables the purchase of content, services, or functionality in the app by means other than the in-app purchase API, which is not appropriate for the App Store.Specifically, your app enables points, or intermediate currencies, without using the in-app purchase API. Additionally, please note that the cost of the points or the intermediate currency cannot be included in the purchase price of the app.Next StepsWhile the payment system that you have included may conduct the transaction outside of the app, if the purchasable content, functionality, or services are intended to be used in the app, they must be purchased using in-app purchase, within the app - unless it is of the type referenced in guideline 3.1.3 of the App Store Review Guidelines. 解决方案：加入苹果内购功能，再次提交审核 第5次提交被拒：在app里面有使用内购充值买艺点，但是找不消费地方。原因：苹果没有找到在哪里消费艺点 12345678Guideline 3.1.1 - Business - Payments - In-App PurchaseWe noticed that your app uses in-app purchase products to purchase credits or currencies that are not consumed within the app, which is not appropriate for the App Store.Next StepsTo resolve this issue, please revise your app to ensure that the credits or currencies purchased with in-app purchase products are used within the app or remove the in-app purchases entirely. 解决方法：在Resolution Center给苹果发送截图，录视频，告诉苹果如何使用艺点购买作品 备注：因为这个被拒了3次，第一次，只发了截图，简单说明了一下，苹果还是没有找到如何消费；第二次，发截图，录视频，再加上解释，苹果依然没有找到；第三次，详细解释，录视频，苹果终于看懂了 第6次提交被拒： 1 我们在支付教程里面，导航栏title 写了苹果支付教程，苹果认为有误导用户 2 我们的app里面有余额提现功能，苹果不知道余额是从哪里来的 12345678910111213141516171819Guideline 1.1.6 - Safety - Objectionable ContentWe noticed that your app’s in-app purchase products are mislabeled as Apple Pay, which could confuse and mislead users.Next StepsTo resolve this issue, please revise your app so that all in-app purchase products include accurate and clear labels. If your app does not include any Apple Pay functionality, please remove any references to Apple Pay from your app and its metadata.Guideline 2.1 - Information NeededWe have started the review of your app, but we are not able to continue because we need additional information about your app.Next StepsTo help us proceed with the review of your app, please provide detailed information to the following questions. The more information you can provide upfront, the sooner we can complete your review.- Please explain who provides reward for identified artists for their public works in the 余额 section? 解释： 1 余额是艺术家在平台上销售自己的作品，平台给的佣金 2 移除苹果支付字眼 第7次提交被拒： 1you have included may conduct the transaction outside of the app, if the purchasable content, functionality, or services are intended to be used in the app, they must be purchased using in-app purchase, within the app - unless it is of the type referenced in guideline 3.1.3 of the App Store Review Guidelines. 大意就是：如果购买的商品是虚拟商品，就必须使用苹果内购，如果是实体商品，就不能使用苹果内购 。 被拒原文： 12345678910Guideline 3.1.1 - Business - Payments - In-App PurchaseWe noticed that your app or its metadata enables the purchase of content, services, or functionality in the app by means other than the in-app purchase API, which is not appropriate for the App Store.Specifically, your app enables points, or intermediate currencies, without using the in-app purchase API. Additionally, please note that the cost of the points or the intermediate currency cannot be included in the purchase price of the app.Next StepsWhile the payment system that you have included may conduct the transaction outside of the app, if the purchasable content, functionality, or services are intended to be used in the app, they must be purchased using in-app purchase, within the app - unless it is of the type referenced in guideline 3.1.3 of the App Store Review Guidelines. 解释：我们的app有虚拟商品和实体商品。虚拟商品仅仅使用苹果内购支付；实体商品可以使用支付宝和苹果内购混合支付 第8次提交被拒： 12345678Guideline 3.1.5 - Business - Payments - Physical Goods and Services Outside of the AppYour app allows users to purchase physical goods or services using the in-app purchase API, which is not appropriate for the App Store.Next StepsTo resolve this issue, please revise your app to use a different purchasing mechanism for physical goods. 大意就是：app使用苹果内购购买实体商品，这是不符合苹果规范的 真品购买 最后在真品购买去掉了苹果内购，提交审核 总结这次审核从11.29号开始审核，一直经过11.22号苹果圣诞节放假，提交了10次，都没有通过。历时一个多月 究其原因：栽在两个主要问题上，Guideline 3.1.1，Guideline 3.1.5 简单来说：苹果内购审核原则就是虚拟商品只能走内购，实体商品不能走内购 1 就是还是没有弄清楚内购的原理。有时候在同一个问题上反复被拒，浪费了好多时间。 2 我们在上线苹果内购的时候，一次上的功能太多，既有虚拟商品，又有实体商品，导致苹果审核有一点问题就被拒，反复解释苹果也无法理解。所以在上线的时候，一次最好只上线一个功能，苹果审核就很容易通过。 参考文献：App Store 审核指南","categories":[{"name":"ios开发","slug":"ios开发","permalink":"http://blog.iruach.com/categories/ios开发/"}],"tags":[{"name":"内购审核","slug":"内购审核","permalink":"http://blog.iruach.com/tags/内购审核/"}]},{"title":"Hexo分类和标签","slug":"Hexo分类和标签","date":"2018-11-26T10:18:42.000Z","updated":"2018-11-26T02:24:40.159Z","comments":true,"path":"2018/11/26/Hexo分类和标签/","link":"","permalink":"http://blog.iruach.com/2018/11/26/Hexo分类和标签/","excerpt":"","text":"hexo 新建一篇文章给它添加分类和标签: 1hexo new &quot;Hexo教程&quot; 通过编辑器打开: 添加tags和categories 123456789---title: title #文章標題date: 2016-06-01 23:47:44 #文章生成時間categories: &quot;Hexo教程&quot; #文章分類目錄 可以省略tags: #文章标签 可以省略- 标签1- 标签2description: #你对本页的描述 可以省略---","categories":[{"name":"Hexo教程","slug":"Hexo教程","permalink":"http://blog.iruach.com/categories/Hexo教程/"}],"tags":[{"name":"分类","slug":"分类","permalink":"http://blog.iruach.com/tags/分类/"}]},{"title":"type","slug":"type-1","date":"2018-11-23T17:52:18.000Z","updated":"2018-11-23T09:52:18.069Z","comments":true,"path":"2018/11/24/type-1/","link":"","permalink":"http://blog.iruach.com/2018/11/24/type-1/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"我的新闻","slug":"type","date":"2018-11-23T17:47:03.000Z","updated":"2018-11-23T09:52:46.783Z","comments":true,"path":"2018/11/24/type/","link":"","permalink":"http://blog.iruach.com/2018/11/24/type/","excerpt":"","text":"我的博客好了","categories":[{"name":"科技","slug":"科技","permalink":"http://blog.iruach.com/categories/科技/"}],"tags":[{"name":"科技","slug":"科技","permalink":"http://blog.iruach.com/tags/科技/"},{"name":"新闻","slug":"新闻","permalink":"http://blog.iruach.com/tags/新闻/"}]},{"title":"常用软件","slug":"常用软件","date":"2018-11-23T15:37:59.000Z","updated":"2018-11-23T07:55:16.980Z","comments":true,"path":"2018/11/23/常用软件/","link":"","permalink":"http://blog.iruach.com/2018/11/23/常用软件/","excerpt":"","text":"Cydia Impactor","categories":[{"name":"软件","slug":"软件","permalink":"http://blog.iruach.com/categories/软件/"}],"tags":[{"name":"software","slug":"software","permalink":"http://blog.iruach.com/tags/software/"}]},{"title":"github pages+hexo 搭建博客","slug":"github-pages-hexo-搭建博客","date":"2018-11-23T14:36:10.000Z","updated":"2018-11-23T07:14:28.417Z","comments":true,"path":"2018/11/23/github-pages-hexo-搭建博客/","link":"","permalink":"http://blog.iruach.com/2018/11/23/github-pages-hexo-搭建博客/","excerpt":"","text":"博客搭建好之后，貌似很久没有写文章了，现在就来分享一下我搭建博客的艰苦行程和一些莫名其妙的坑。 ps:本博客是在MAC环境下进行搭建的，并且对github pages和一些shell脚本知识有所了解。 首先简单描述一下搭建的大体流程吧（其实挺简单的，只是体力活费时而已）： 拥有一个github pages 在本地电脑里配置hexo的环境。（ hexo与github pages绑定，写博文修改博文等，生成静态博客并push to github。) 绑定自己的域名（也可以不用绑定，github pages有二级域名，只不过绑定了一个属于自己的域名更有逼格点儿。） Github Pages （第一步）Github Pages免费的静态站点，其特点：免费托管、自带主题、支持自制页面等。 创建Github Pages比较简单，只要你有一个github账号在创建一个仓库就行了，但是这个仓库是有规则的，其格式必须为： yourusername.github.io。然后根据提示一直下一步即可，非常简单。 image 作为一个开发者，要是连一个github账号都没有，那你可以洗洗睡了。 而仓库命名格式中的yourusername是你的github用户名。笔者的github用户名是wandou911。所以仓库命名格式则是wandou911.github.io Hexo （第二步）Hexo 是一个快速、简洁且高效的博客框架。Hexo 使用 Markdown（或其他渲染引擎）解析文章，在几秒内，即可利用靓丽的主题生成静态网页。 安装Hexo的安装网上有很多教程，但很多都很蛋疼且过期技术，所以最好的还是参考Hexo官方的安装教程来一步一步走。在此笔者也不写详细教程了，因为可能不出2个月就坑了小伙伴们。中文版Hexo文档点此进行传送。。。 本地环境说白了就是要有Git和Node.js环境即可。详情参见官网文档为准，也最好参考官网，避免入坑。 1npm install hexo-cli -g 建站Hexo安装好了之后，就开始进行建站。打开终端cd到桌面并使用如下命令即可建好 123hexo init yournamecd yournamenpm install 其中yourname是你的文件夹名字可随意取（本文章假设yourname的文件夹名称是Hexo）。建站好了之后需要了解更多的信息和其他步骤请参考官网的这篇文档。https://hexo.io/zh-cn/docs/setup.html 这里需要特别提一下，官方的文档里并没讲解如何配置与Github pages进行关联，在此特意说一下配置信息。进入到你的站点（使用hexo init yourname命令时，这里的yourname文件夹目录，刚假设yourname是Hexo，所以我们进入Hexo目录），然后以文本编辑器打开_config.yml文件，并滚动到最下面添加如下配置信息（注意最下边有deploy和type字段，覆盖这两个字段或者删除这两个字段然后复制下面的四个字段也行。）： 1234deploy:type: gitrepo: https://github.com/biggercoffee/biggercoffee.github.io.gitbranch: master 注意：type后面：号和git之间的空格 把其中repo字段的值替换成你的github pages提交代码的git地址。 别告诉我你不知道你的github pages的git提交地址。。。好吧，我还是附上一张截图吧，进入到你的github刚创建好的那个github pages仓库就能看到了。 image 好吧，到此你使用终端，然后进入到你的站点文件夹Hexo 输入命令： 1hexo s 如果成功会打印类似Hexo is running at http://localhost:4000/. Press Ctrl+C to stop的一句话，再打开你的浏览器输入localhost:4000地址见证神奇的一刻吧。 发布当然这只是本地跑起来了，而你的github pages服务器上并没有，所以你就需要在你的站点里使用终端命令进行发布： 123hexo cleanhexo ghexo d 命令详解，第一条是清楚缓存，第二条命令是生成本地发布文件夹，第三条命令才是最后的发布到github pages上。更多的hexo命令操作请参考官方文档即可。不过一般用来用去无非就是创建页面、发布这么几条命令而已。Hexo官方命令参考文档 其实学习一个新东西有事没事多去官方看文档，比在网上查资料要来的更靠谱的多。 HEXO主题如果你到了这里没有任何问题，那么恭喜你已经成功了，不过这才刚刚开始。当你成功的看到自己博客搭建好的那一刻又是激动又是失望，激动的是博客总算折腾出来了，失望的是，为何如此的丑。。。说实话Hexo默认的主题自我感觉还过得去，如果你想换风格,Hexo的主题网上随便一搜也有很多。在此笔者使用的博客主题是indigo（国人写的）。https://github.com/yscoder/hexo-theme-indigo indigo文档已经写得很详细了（上述链接里有文档地址），笔者在此不再详述。 主题安装：安装需确认你的 Hexo 版本在 3.0 以上，以及 Node 版本为 6.x 以上，在 Hexo 根目录，执行以下命令。 1git clone git@github.com:yscoder/hexo-theme-indigo.git themes/indigo 打开Hexo目录 进入themes目录，就可以看到刚刚下载的主题 Hexo目录 Hexo目录 themes目录 themes目录 主题配置：找到Hexo目录下的_config.yml因为之后还会用到，所以我们在此约定一下，将这个配置文件叫做站点配置文件，找到theme选项，把主题切换为indigo .如下图,将原来的landscape删掉，改为indigo indigo主题配置 域名绑定（第三步，可选）笔者是在万网买的域名（http://iruach.com/）。 域名买好之后提交实名认证等，这些操作就不在赘述。域名购买地址https://wanwang.aliyun.com/。 这里需要特别提一下的就是万网如何与github pages进行绑定，首先假设你有一个域名并且是可用状态。修改你域名的DNS地址为 f1g1ns1.dnspod.net和f1g1ns2.dnspod.net image 然后在你的本地站点目录里的source目录下添加一个CNAME文件，不带后缀，效果如下 image 以文本编辑器打开CNAME，里面添加你的域名信息（不加http://） 如下图 image 填写完了之后再重新部署到github pages上（部署简写命令hexo d -g)下一步注册DNSpod，然后添加域名，添加记录即可。 添加域名填写你的域名即可，老规矩不用添加http://，然后在点击你的域名点进去在添加CNAME记录即可（其中记录中CNAME的值是你的github pages的地址）。 image 那么现在把你本地的Hexo生成一下在提交到Github pages上吧 生成和提交简写命令: 1hexo d -g 然后打开你的浏览器输入你购买的域名尝试吧。笔者的博客域名：http://blog.iruach.com/ ps1:万网DNS地址更换貌似需要一段时间才能生效，如果不能访问请晚点或者隔天再访问域名，如果还是不行可能就是出问题了。反正笔者当时运气好，修改了万网DNS之后即时生效。 ps2:由于笔者用的是二级域名，如果是一级域名，上面CNAME文件和DNSPOD解析如下图即可： CNAME文件写入iruach.com image DNSPOD解析主机记录写入www image 笔者分享分享一些笔者用Hexo写文章的tips 文章管理一般笔者写文章、修改文章是在本地可视化写文章，然后在使用命令提交上去。笔者使用的是一个hexo可视化文章管理的插件（hey），地址：https://github.com/nihgwu/hexo-hey 。 当然也有一个Hexo的admin插件，但是那个插件不支持图片拖拽进来，所以笔者推荐使用hey。安装和使用详情，参见笔者给出的github地址。 shell脚本自动化（可忽略，只是一个想法）开启Hexo的本地服务或者提交到github pages这些都是一些终端里的Hexo命令，所以笔者写了一些shell脚本，来简化这些操作。所以基本就是用hey可视化写文章，写好了之后，然后点击一键部署的shell脚本，然后就自动发布了（当然这也纯属鸡助，看个人。）。由于shell脚本比较简单，随意网上搜索资料一大堆。再加上笔者自己写的脚本代码也没上传，在此插入一个一键部署的shell脚本代码 1234cd Desktop/Hexohexo cleanhexo ghexo d cd到自己的站点目录，然后直接使用hexo命令即可。shell脚本自动化操作就是封装了这些命令而已，在此也只是提供这么一个想法，既然我们都是coder，何不善用自己已有的知识尼。写到最后 github pages虽然免费，但毕竟是国外的服务器，国内访问可以稍微缓慢，如果是土豪，可去买一个支持Node.js的国内云空间即可。总之github pages + hexo搭建博客还是挺能折腾人的。但毕竟免费，而且身为技术人员不就是该具备折腾的精神吗？（博客地址点此） Hexo常见问题 在执行 hexo deploy或者 hexo d 后,出现 error deployer not found:git 的错误处理 输入代码： 1npm install hexo-deployer-git --save 部署： hexo d 参考链接:1 我的博客是如何搭建的（github pages + HEXO + 域名绑定） 2 hexo官方文档 3 有哪些好看的 Hexo 主题 4 Hexo常见问题 5 博客搭建详细教程","categories":[{"name":"博客","slug":"博客","permalink":"http://blog.iruach.com/categories/博客/"}],"tags":[{"name":"web","slug":"web","permalink":"http://blog.iruach.com/tags/web/"}]},{"title":"","slug":"manifest","date":"2018-11-23T06:34:23.181Z","updated":"2018-11-26T09:40:03.015Z","comments":true,"path":"2018/11/23/manifest/","link":"","permalink":"http://blog.iruach.com/2018/11/23/manifest/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Hexo快速上手","slug":"hexo-开始","date":"2018-11-23T06:34:23.180Z","updated":"2018-11-23T06:34:23.180Z","comments":true,"path":"2018/11/23/hexo-开始/","link":"","permalink":"http://blog.iruach.com/2018/11/23/hexo-开始/","excerpt":"","text":"指令init1$ hexo init [folder] 新建一个网站。如果没有设置 folder ，Hexo 默认在目前的文件夹建立网站。 new1$ hexo new [layout] &lt;title&gt; 新建一篇文章。如果没有设置 layout 的话，默认使用 _config.yml 中的 default_layout 参数代替。如果标题包含空格的话，请使用引号括起来。 generate1$ hexo generate 生成静态文件。 选项 描述-d, –deploy 文件生成后立即部署网站-w, –watch 监视文件变动该命令可以简写为1$ hexo g publish1$ hexo publish [layout] &lt;filename&gt; 发表草稿。 server1$ hexo server 启动服务器。默认情况下，访问网址为： http://localhost:4000/。 选项 描述-p, –port 重设端口-s, –static 只使用静态文件-l, –log 启动日记记录，使用覆盖记录格式 deploy1$ hexo deploy 部署网站。 参数 描述-g, –generate 部署之前预先生成静态文件该命令可以简写为：1$ hexo d render1$ hexo render &lt;file1&gt; [file2] ... 渲染文件。 参数 描述-o, –output 设置输出路径 migrate1$ hexo migrate &lt;type&gt; 从其他博客系统 迁移内容。 clean1$ hexo clean 清除缓存文件 (db.json) 和已生成的静态文件 (public)。 在某些情况（尤其是更换主题后），如果发现您对站点的更改无论如何也不生效，您可能需要运行该命令。 list1$ hexo list &lt;type&gt; 列出网站资料。 version1$ hexo version 显示 Hexo 版本。","categories":[{"name":"云服务器","slug":"云服务器","permalink":"http://blog.iruach.com/categories/云服务器/"}],"tags":[{"name":"科技","slug":"科技","permalink":"http://blog.iruach.com/tags/科技/"},{"name":"网页","slug":"网页","permalink":"http://blog.iruach.com/tags/网页/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-11-23T06:34:23.178Z","updated":"2018-11-23T06:34:23.179Z","comments":true,"path":"2018/11/23/hello-world/","link":"","permalink":"http://blog.iruach.com/2018/11/23/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"Test","slug":"Test","date":"2018-11-22T19:13:35.000Z","updated":"2018-11-23T06:34:23.181Z","comments":true,"path":"2018/11/23/Test/","link":"","permalink":"http://blog.iruach.com/2018/11/23/Test/","excerpt":"","text":"（1）将站点配置文件中的 post_asset_folder 选项设置成 true （2）在站点文件夹中打开 git bash，输入命令 npm install hexo-asset-image –save 安装插件 （3）此时使用 hexo new title 创建文章时，将同时在source/_post文件夹中生成一个与title同名的文件夹，我们只需将待添加的图片放进此文件夹中，然后在文章中通过Markdown语法进行引用即可，例如，在资源文件夹（就是那个与title同名的文件夹）中添加了图片example.PNG，则可以在对应的文章中使用语句 示例图片 添加图片 好了，常用的markdown语法至此我们已经基本学习完毕了， 然后我们就可以根据这些语法去书写我们的博客内容啦，下面再提供几个比较高级的玩法：","categories":[],"tags":[{"name":"科技","slug":"科技","permalink":"http://blog.iruach.com/tags/科技/"},{"name":"网页","slug":"网页","permalink":"http://blog.iruach.com/tags/网页/"}]},{"title":"hexo categories和tags页面不显示解决办法","slug":"hexo categories和tags页面不显示解决办法","date":"2016-06-01T23:47:44.000Z","updated":"2018-11-26T02:56:17.143Z","comments":true,"path":"2016/06/02/hexo categories和tags页面不显示解决办法/","link":"","permalink":"http://blog.iruach.com/2016/06/02/hexo categories和tags页面不显示解决办法/","excerpt":"","text":"方法一： scaffolds/draft.md 1234---title: &#123;&#123; title &#125;&#125;tags: &#123;&#123; tags &#125;&#125;--- scaffolds/post.md 12345---title: &#123;&#123; title &#125;&#125;date: &#123;&#123; date &#125;&#125;tags: &#123;&#123; tags &#125;&#125;--- tags/index 123456---title: Tagclouddate: 2017-04-26 17:47:43type: &quot;tags&quot;layout: &quot;tags&quot;--- 方法二： 默认是没有 categories 和 tags 的需要 123hexo new page &quot;tags&quot; hexo new page &quot;categories&quot; 编辑 /tags/index.md /categories/index.md 123456type: &quot;tags&quot;layout: &quot;tags&quot;type: &quot;categories&quot;layout: &quot;categories&quot; ps: ⚠️ hexo主题不一样 有的是type: tags 有的是layout: tags 我当时tags 点击某一个tag的时候能正常显示 但是点击全部就显示 原因就是这个layout: tags 没有配置 导致没有生成index.html 后来这篇文章才找到原因 how to generate tags/index.html保险起见 type和layout都配置 参考文献： 1 hexo categories和tags页面不显示解决办法 2 how to generate tags/index.html","categories":[{"name":"Hexo教程","slug":"Hexo教程","permalink":"http://blog.iruach.com/categories/Hexo教程/"}],"tags":[{"name":"tags","slug":"tags","permalink":"http://blog.iruach.com/tags/tags/"},{"name":"categories","slug":"categories","permalink":"http://blog.iruach.com/tags/categories/"}]}]}